In [39]:
import pandas as pd
from collections import defaultdict

In [40]:
cd ../ml-latest

/Users/ioanwilliams/notebooks/Recommendation Systems/ml-latest

In [41]:
ratings = pd.read_csv(r"ratings.csv")
ratings.drop('timestamp',axis=1,inplace=True)
print(ratings.dtypes)
ratings.head()

userId       int64
movieId      int64
rating     float64
dtype: object

   userId  movieId  rating
0       1      110     1.0
1       1      147     4.5
2       1      858     5.0
3       1     1221     5.0
4       1     1246     5.0

In [42]:
movies = pd.read_csv(r"movies.csv")
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [43]:
ratings.userId.max()
my_ratings = pd.read_csv(r"../movielens-ratings.csv")
my_ratings.drop(['title','average_rating','imdb_id','tmdb_id'],axis=1,inplace=True)
my_ratings['userId'] = ratings.userId.max() + 1
my_ratings.rename(columns={'movie_id': 'movieId'}, inplace=True)
my_ratings.shape
new_ratings = pd.merge(my_ratings, movies, how='inner', on=['movieId'])
new_ratings.drop(['title','genres'],axis=1,inplace=True)
new_ratings.head()

   movieId  rating  userId
0        1     3.0  270897
1        2     2.5  270897
2        6     4.0  270897
3       10     4.0  270897
4       11     2.0  270897

In [44]:
#union my ratings and official ratings
all_ratings = pd.concat([ratings,new_ratings], sort = False)
all_ratings.tail()

     userId  movieId  rating
720  270897   171011     5.0
721  270897   171495     3.0
722  270897   172217     1.0
723  270897   174055     4.0
724  270897   174685     4.0

In [45]:
all_ratings.count()

userId     26025014
movieId    26025014
rating     26025014
dtype: int64

In [46]:
all_ratings.to_csv("all_ratings.csv")